{
	"element":{
		"classname" :"modules",
		"title" :"Mo",
		"name"	:"Module",
		"description":"Ousider & Generic",
		"package":"mods"
	},
	"items" :[
		{
			"name" :"Reduxtore",
			"authors" :["Eduardo Ottaviani"],
			"description" :"A Redux Store AMD implementation.",
			"section" :"Persistence"
		},
		{
			"name" :"Throwable",
			"authors" :["Eduardo Ottaviani"],
			"description" :"This modules helps you to handling exceptions and keeping all the modules working if some other module breaks. Also, helps you to subscribe to custom events to handle common errors outside your module logic.",
			"section" :"Error Handling"
		},
		{
			"name" :"Logger",
			"authors" :["Eduardo Ottaviani"],
			"description" :"Logger module helps you to visualize all the subscriptions and publishing events and also to easily track your Jails application mistakes from Jails workflow perspective.",
			"section" :"Debug"
		},
		{
			"name" :"url",
			"authors" :["Eduardo Ottaviani"],
			"description" :"The url module helps you to redirect application url easily. It will change only the hash from location object, used on deeplink applications.",
			"section" :"URL"
		},
		{
			"name" :"routr",
			"authors":["Eduardo Ottaviani"],
			"description" :"An improved Router for your applications, simple calls, more faster then Router and standalone. It was created after observations on the regular Router usage, so has the same advantages but and better written.",
			"section" :"URL"
		},
		{
			"name" :"storage",
			"authors" :["Eduardo Ottaviani"],
			"description" :"This AMD module has the simplest way to use the localStorage and sessionStorage objects, very useful to persist data on client side.",
			"section" :"Persistence"
		},

		{
			"name" :"cache",
			"authors" :["Eduardo Ottaviani"],
			"description" :"A simple module for caching data, it can be used to save some url of ajax requests for instance.",
			"section" :"Persistence"
		},

		{
			"name" :"cookies",
			"authors" :["Leandro Vieira Pinho", "Eduardo Ottaviani"],
			"description" :"Just a simple cookie wrapper to deal with document.cookie property.",
			"section" :"Persistence"
		},
		{
			"name" :"pubsub",
			"authors" :["Eduardo Ottaviani"],
			"description" :"A global pubsub container to handle publish and subscribe pattern, triggers a custom event and listen to them aswell. Very useful to decouple your components and make them more standalone",
			"section" :"Events"
		}

	]
}
